/*
Напишите программу,которая на вводе принимает
два числа, а на выходе даёт их квадрат.
Например:
4 -> 16
*/
Console.Write("Input number => ");
int number = Convert.ToInt32(Console.ReadLine());

int squareNumber = number * number;

Console.WriteLine(squareNumber);

